const practices = {
       rajaka: 'Комплекс, направленный на проработку позвоночника, тазобедренных, плечевых, коленных суставов, растяжка плеч, задней и передней поверхности бедра, подходы к раджакапотасане...',
       supta: 'Йога лёжа! Жёсткая, но эффективная растяжка и укрепление мышц шеи, спины, проработка мышц задней поверхности бедра, укрепление брюшного пресса.',
       budha: 'Цикл упражнений, направленный на проработку тазобедренных суставов, костей таза, поясничного отдела позвоночника.',
       ns: 'Нижние стойки - упражнения, направленные на увеличение силы рук для отстройки асан с опорой на руки.',
       padma: 'Сочетание динамических комплексов и статичных асан для проработки и увеличения гибкости коленных и тазобедренных суставов. Свободное усаживание в позу лотоса.',
       balance: 'Развитие равновесия за счёт тренировки групп мышц, отвечающих за определённые положения тела, удержание баланса стоя на одной ноге, в перевёрнутых стойках, в нижних стойках на руках.',
       setuBandha: 'Проработка позвоночника: укрепление и растяжка мышц спины, прогибы назад, повороты, различные варианты полумостов, мостов и подходы к ним.',
       armus: 'Тренировка, направленная на проработку мышц, связок и суставов плеча, лопатки для увеличения их подвижности и силы.',
       parivrita: 'Цикл упражнений для проработки глубоких мышц позвоночника. Корректное вытягивание, повороты и укрепление мышц спины. Для исправления осанки, увеличения гибкости позвоночника.',
       warCycle: 'Весь цикл направлен на очень мощную и эффективную проработку тазобедренных, коленных и голеностопных суставов + комплекс на гибкость пальцев ног.',
       samakona: 'Компактный сверхэффективный комплекс проработки ног, мышц таза и промежности, тазобедренных суставов для выполнения поперечного шпагата, ключевые принципы работы с суставами и сухожилиями.',
       hanumana:'Корректное сочетание растягивания, расслабления и напряжения мышц связок и суставов ног для выполнения продольного шпагата.'
   }

const {rajaka, supta, budha, ns, padma, balance, setuBandha, armus, parivrita, warCycle, samakona, hanumana} = practices;

const switchText = function(name) {
    let text;
    switch(name) {
        case 'Раджака':
           text = rajaka;
           break
        case 'Супта':
            text = supta;
           break
        case 'Будха':
            text = budha;
           break
        case 'НС':
            text = ns;
           break
        case 'Падма':
            text = padma;
           break
        case 'Баланс':
            text = balance;
           break
        case 'Сету Бандха':
            text = setuBandha;
           break
        case 'Армус':
            text = armus;
           break
        case 'Париврита':
            text = parivrita;
           break
        case 'Цикл воина':
            text = warCycle;
            break
        case 'Самакона':
            text = samakona;
            break
        case 'Ханумана':
            text = hanumana;
            break
        default:
            text = 'Занятие йогой!'
            break
    }
    return text;
}

export default switchText;